# config.py

from typing import Dict, List

#########################################
#  プレースホルダー  #
#########################################

# 各プレースホルダー用リストの定義
#### E1「肌の疲れ」等の表現
TUKARE_LIST: List[str] = ["疲れ", "疲れた",
                         "の疲れ", "に出た疲れ", "に出た仕事の疲れ"]

#### E2「アレルギーテスト済み」等の表現
E2_LIST: List[str] = ["済(み)?", "((も)|(を))?クリア"]

####（主に病名）
#### F3 医薬部外品の効能効果の表現の範囲
#### F1 医薬品または医薬部外品とまぎらわしい名称
F1_LIST: List[str] = ["アレルギー", "アトピー(性皮膚炎)?", "湿疹", "酒さ", "赤ら顔", "痒み", "型脱毛", "円形脱毛", 
                      "頭痛", "風邪", "鼻炎", "皮膚がん"]

####（医薬品的効能効果）
#### F34_共通_医薬品的表現
IYAKU_LIST: List[str] = ["消炎効果", "炎症を抑える"]

####（添加物）
#### E15「美白」等の表現
TENKA_LIST: List[str] = ["ヒアルロン酸"]

#### F4 化粧品の効能効果の表現の範囲
EISEI_LIST: List[str] = ["の清浄", "の清拭"]

#### F34_共通_医薬品的表現
SOKUSIN_LIST: List[str] = ["((も)|(を))?促進", "((も)|(を))?促す", "((も)|(を))?促し"]

#### F7 効能効果又は安全性を保証する表現の禁止
AN_HOSYO_LIST: List[str] = ["赤ちゃん", 
                            "お年寄り(の方)?", 
                            "敏感肌(の方)?", 
                            "誰でも", "だれでも",
                            "比較的", 
                            "天然成分を使用しているので", 
                            "いくら使っても", "使用法を問わず"]

#### F11 医薬関係者等の推せん
F11_1_LIST: List[str] = [
    "((が)|(の)|(も))?イチオシ", 
    "((が)|(の)|(も))?おすすめ",  
    "((が)|(の)|(も))?公認",  
    "((が)|(の)|(も))?推薦",  
    "((が)|(の)|(も))?推奨",  
    "((が)|(の)|(も))?勧める",  
    "((が)|(の)|(も))?奨める", 
    "((が)|(の)|(も))?認めた", 
    "((が)|(の)|(も))?認める",  
    "((が)|(も))?絶賛", 
    "((が)|(も))?大絶賛", 
    "((が)|(も))?選ぶ", 
    "((が)|(も))?選んだ", 
    "((が)|(も))?愛用",
    "((が)|(も))?推す",  
    "((が)|(も))?推してる", 
    "((が)|(も))?使ってる", 
    "((が)|(も))?手放さない", 
    "((が)|(も))?デイリー使い", 
    "に聞いた", "の友達に聞いた", 
    "が教えてくれた"
]

#### F11 共同開発
KAIHATU_LIST: List[str] = ["と(の)?共同研究",
                           "((が)|(と)|(の))?開発"]

#### F11 医薬関係者等の推せん
F11_5_LIST: List[str] = ["((が)|(も))?認可", 
                         "((が)|(も))?承認", 
                         "((が)|(も))?許可", 
                         "((が)|(も))?が認めた"]

#### E4「○○専用、○○用」等の表現
KODOMO_LIST: List[str] = ["子供", "子ども", "こども"]

#### E6 しわ予防・解消等の表現
#### E7「乾燥による小ジワを目立たなくする」の表現
YOBOU_LIST: List[str] = ["((の)|(を))?予防", 
                         "((の)|(を))?防止", 
                         "(を)?防((ぐ)|(ぎ)|(いで)|(げる))?", 
                         "を根本から((予防)|(防ぐ)|(防ぎ))?"]

#### E6 しわ予防・解消等の表現
#### E17 毛髪の損傷等の補修表現
#### F3 医薬部外品の効能効果の表現の範囲
KAIZEN_LIST: List[str] = ["(を)?改善"]

#### E6 しわ予防・解消等の表現
#### E7「乾燥による小ジワを目立たなくする」の表現
#### E15「美白」等の表現
#### F3 医薬部外品の効能効果の表現の範囲
KAISHOU_LIST: List[str] = ["((の)|(を))?解消", "を根本から解消", "の悩みを解消", "の原因根本解消", "もこれで解消", 
                           "(が)?治る", "を治((し)|(す))?", 
                           "を直((し)|(す))?",
                           "((が)|(を))?解決", "根本解決", "((も)|(を))?すべて解決",
                           "(など)?に効く", "(など)?に有効", 
                           "(を)?なくす", "がなくなる", "がなくなり", 
                           "(を)?残さない", "(を)?残さず",
                           "レス", 
                           "(を)?抹消", 
                           "(を)?撃退", 
                           "(を)?消したい", "((が)|(も))?消え", "を消((し)|(す))?", 
                           "がすっきり消え", "をすっきり消((し)|(す))?", "を根こそぎ消す", "を根こそぎ消し", "が根こそぎ消え", 
                           "(を)?消し去る", "((もとから)|(元から))?消し去る", 
                           "(を)?取り去る", "の悩みを取り去る", 
                           "((の)|(を))?除去", 
                           "(を)?駆逐", 
                           "の痛みを和らげる", 
                           "(を)?シャットアウト"]

#### E7「乾燥による小ジワを目立たなくする」の表現
STOP_LIST: List[str] = ["に待った", "にストップ"]

#### E7「乾燥による小ジワを目立たなくする」の表現
WAKAGAERI_LIST: List[str] = ["若返る", "若返り", "若返らせて"]

#### E17 毛髪の損傷等の補修表現
KAWARU_LIST: List[str] = ["(が)?変化", "(を)?変える", "(が)?変わる"]

#### E17 毛髪の損傷等の補修表現
SAISEI_LIST: List[str] = ["((が)|(を))?再生", 
                          "((が)|(を))?回復", 
                          "(が)?生き返((る)|(り))?", "(を)?生き返らせ", 
                          "(が)?甦((る)|(り))?", "(を)?甦らせ", 
                          "(が)?よみがえ((る)|(り))?", "(を)?よみがえらせ"]

#### E18 エイジングケア
KOUKA_LIST: List[str] = ["ハリ", "保湿", "キメ", "うるおい", "ツヤ", "整肌", "皮膚の保護"]

#-------------------------------------------#
#  化粧品における特定成分の特記表示関連のリスト
#-------------------------------------------#

# 特記成分
SEIBUN_LIST: List[str] = ["アミノ酸", "アロエエキス", "アロエ・エキス", "アラントイン", "エラスチン", 
                          "カチオン誘導体", "カミツレエキス", "カモミラET", "キュウリエキス",
                          "グリセリン", "グリチルリチン酸ジカリウム", "グリチルリチン酸モノアンモニウム", 
                          "コラーゲン", 
                          "シラカバエキス", "セラミド", 
                          "タルク", "天然植物薏苡仁エキス",
                          "トウキンセンカエキス", "トラネキサム酸", 
                          "ヒアルロン酸", "ビタミンA", "ビタミンB", "ビタミンC", "ビタミンC誘導体", "ビタミンD", "ビタミンE", "ビタミンK",
                          "プロテイン", "ヘチマエキス", "紅花油", 
                          "ボダイジュエキス", "ホホバ油", "ホホバオイル",
                          "ミツロウ",
                          "ラノリン", "レシチン", "レチノール", "ローズマリーエキス",
                          "4-メトキシサリチル酸カリウム塩"]

# 配合目的
MOKUTEKI_LIST: List[str] = ["うるおい成分", 
                            "枝毛や切毛を防ぐ", "エモリエント成分", 
                            "乾燥を防ぐ", "抗酸化剤",
                            "紫外線吸収剤", "紫外線防止剤", "収斂剤", "収れん剤", 
                            "水分と油分を補", 
                            "整肌成分", "静電気を抑え", "洗浄剤",
                            "帯電防止剤",
                            "着香料", "着色料", "天然保湿剤", 
                            "トリートメント成分",
                            "にうるおいを与え",
                            "肌荒れを防ぐ", "肌荒れ防止剤", "肌荒れ防止成分",
                            "美白有効成分", "日ざしをさえぎり", 
                            "皮膚保護剤", "皮膚を保護する", "日やけを防ぐ",
                            "保護成分", "保湿剤", "保湿成分", "補油成分",
                            "毛髪の帯電を防止する", 
                            "をしっとりさせる成分"]

# 除外ワード
JYOGAI_LIST: List[str] = ["プロテインシャンプー", "アミノ酸系シャンプー"]

#-------------------------------#
#  プレースホルダーをまとめた辞書
#-------------------------------#

PLACEHOLDER_VALUES: Dict[str, List[str]] = {
    "TUKARE": TUKARE_LIST,
    "E2": E2_LIST,
    "F1": F1_LIST,
    "IYAKU": IYAKU_LIST,
    "TENKA": TENKA_LIST,
    "EISEI": EISEI_LIST,
    "SOKUSIN": SOKUSIN_LIST,
    "AN_HOSYO": AN_HOSYO_LIST,
    "F11_1": F11_1_LIST,
    "KAIHATU": KAIHATU_LIST,
    "F11_5": F11_5_LIST,
    "KODOMO": KODOMO_LIST,
    "YOBOU": YOBOU_LIST,
    "KAIZEN": KAIZEN_LIST,
    "KAISHOU": KAISHOU_LIST,
    "STOP": STOP_LIST,
    "WAKAGAERI": WAKAGAERI_LIST,
    "SEIBUN": SEIBUN_LIST,
    "MOKUTEKI": MOKUTEKI_LIST,
    "JYOGAI": JYOGAI_LIST,
    "KAWARU": KAWARU_LIST,
    "SAISEI": SAISEI_LIST,
    "KOUKA": KOUKA_LIST
}
